app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("task", "note", "completed", "reminder", "due_date", "time", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @task = current_user.tasks.build(task_params)

    respond_to do |format|
      if @task.save